#include "DS1302.h"

/* ***************************************************** */
// 数组定义
/* ***************************************************** */
//DS1302读地址，秒分时日月星期年
unsigned char code DS1302_ReadAddr[7] = {0x81,0x83,0x85,0x87,0x89,0x8B,0x8D};

//DS1302写地址，秒分时日月星期年
unsigned char code DS1302_WriteAddr[7] ={0x80,0x82,0x84,0x86,0x88,0x8A,0x8C};

//DS1302初始化时间,202004050 131400 星期三
unsigned char TIME[7] = {0, 0x59, 0x06, 0x15, 0x04, 0x03, 0x20};
/* ***************************************************** */


/* ***************************************************** */
// 函数名称：DS1302_Write
// 函数功能: 向DS1302写入数据
// 入口参数：地址addr 数据dat
// 出口参数：无 
/* ***************************************************** */
void DS1302_Write(u8 addr,u8 dat)
{
	u8 i;
	CE = 0;             //禁止数据传输
	_nop_();
	SCLK = 0;           //确保写数据前保持SCLK为低电平
	_nop_();            
	CE = 1;             //即上升沿时开启数据传输
	_nop_();
	for(i=0;i<8;i++)
	{
		DATA = addr & 0x01;   //取数据最低位
		addr >>= 1;          //数据右移
		SCLK = 1;            //SCLK时钟上升沿时，DS1302读取数据
		_nop_(); 
		SCLK = 0;            //为写入dat数据做准备      
        _nop_();		
	}
	for(i=0;i<8;i++)
	{
	    DATA = dat & 0x01;   //取数据最低位
		dat >>= 1;          //数据右移
		SCLK = 1;            //SCLK时钟上升沿时，DS1302读取数据
		_nop_(); 
		SCLK = 0;            //为写入dat数据做准备 	
		_nop_();
	}
	CE = 0;                  //数据传输结束
	_nop_();	
}

/* ***************************************************** */
// 函数名称：DS1302_Read
// 函数功能: 读取任意地址的数据
// 入口参数：地址 addr
// 出口参数：数据 dat
/* ***************************************************** */
unsigned char DS1302_Read(u8 addr)
{
	u8 i,temp,dat;
	CE = 0;
	_nop_();
	SCLK = 0;
	_nop_();
	CE = 1;
	_nop_();
	for(i=0;i<8;i++)
	{
		DATA = addr & 0x01;   //取数据最低位
		addr >>=1;
		SCLK = 1;
		_nop_();
		SCLK = 0;
		_nop_();		
	}
	_nop_();
	for(i=0;i<8;i++)
	{
		temp = DATA;
		dat = (dat>>1) | (temp<<7);
		SCLK = 1;
		_nop_();
		SCLK = 0;    //DS1302下降沿时,放置数据
		_nop_();
	}
	CE = 0;
	_nop_();
	SCLK = 1;
	_nop_();
	DATA = 0;
	_nop_();
	return dat;
}
/* ***************************************************** */
// 函数名称：DS1302_Init
// 函数功能: 初始化DS1302
// 入口参数：无
// 出口参数：无 
/* ***************************************************** */
void DS1302_Init(void)
{
	u8 i;
	DS1302_Write(0x8E,0x00);         //禁止写保护
	for(i=0;i<7;i++)
	{
		DS1302_Write(DS1302_WriteAddr[i],TIME[i]);
	}
	DS1302_Write(0x8E,0x80);         //使能写保护
}

/* ***************************************************** */
// 函数名称：DS1302_ReadTime
// 函数功能: 读取时钟信息
// 入口参数：无
// 出口参数：无 
/* ***************************************************** */

void DS1302_ReadTime(void)
{
	u8 i;
	for(i=0;i<7;i++)
	{
		TIME[i] = DS1302_Read(DS1302_ReadAddr[i]);
	}
}

